maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_dcsm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABRAM1R register
//
//*****************************************************************************
#define DCSM_Z2_GRABRAM1R_GRAB_RAM0_S  0U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM0_M  0x3U         // Grab RAM CPU1.LS0
#define DCSM_Z2_GRABRAM1R_GRAB_RAM1_S  2U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM1_M  0xCU         // Grab RAM CPU1.LS1
#define DCSM_Z2_GRABRAM1R_GRAB_RAM2_S  4U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM2_M  0x30U        // Grab RAM CPU1.LS2
#define DCSM_Z2_GRABRAM1R_GRAB_RAM3_S  6U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM3_M  0xC0U        // Grab RAM CPU1.LS3
#define DCSM_Z2_GRABRAM1R_GRAB_RAM4_S  8U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM4_M  0x300U       // Grab RAM CPU1.LS4
#define DCSM_Z2_GRABRAM1R_GRAB_RAM5_S  10U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM5_M  0xC00U       // Grab RAM CPU1.LS5
#define DCSM_Z2_GRABRAM1R_GRAB_RAM6_S  12U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM6_M  0x3000U      // Grab RAM CPU1.LS6
#define DCSM_Z2_GRABRAM1R_GRAB_RAM7_S  14U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM7_M  0xC000U      // Grab RAM CPU1.LS7
#define DCSM_Z2_GRABRAM1R_GRAB_RAM8_S  16U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM8_M  0x30000U     // Grab RAM CPU1.D0
#define DCSM_Z2_GRABRAM1R_GRAB_RAM9_S  18U
#define DCSM_Z2_GRABRAM1R_GRAB_RAM9_M  0xC0000U     // Grab RAM CPU1.D1

//*****************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABRAM2R register
//
//*****************************************************************************
#define DCSM_Z2_GRABRAM2R_GRAB_RAM0_S  0U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM0_M  0x3U         // Grab RAM CM.C0
#define DCSM_Z2_GRABRAM2R_GRAB_RAM1_S  2U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM1_M  0xCU         // Grab RAM CM.C1
#define DCSM_Z2_GRABRAM2R_GRAB_RAM4_S  8U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM4_M  0x300U       // Grab RAM CPU1TOCM MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM5_S  10U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM5_M  0xC00U       // Grab RAM CPU1TOCM MSGRAM0_H
#define DCSM_Z2_GRABRAM2R_GRAB_RAM6_S  12U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM6_M  0x3000U      // Grab RAM CMTOCPU1 MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM7_S  14U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM7_M  0xC000U      // Grab RAM CMTOCPU1 MSGRAM0_H
#define DCSM_Z2_GRABRAM2R_GRAB_RAM8_S  16U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM8_M  0x30000U     // Grab RAM CPU2TOCM MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM9_S  18U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM9_M  0xC0000U     // Grab RAM CPU2TOCM MSGRAM0_H
#define DCSM_Z2_GRABRAM2R_GRAB_RAM10_S  20U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM10_M  0x300000U    // Grab RAM CMTOCPU2 MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM11_S  22U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM11_M  0xC00000U    // Grab RAM CMTOCPU2 MSGRAM0_H
#define DCSM_Z2_GRABRAM2R_GRAB_RAM12_S  24U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM12_M  0x3000000U   // Grab RAM CPU1TOCPU2 MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM13_S  26U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM13_M  0xC000000U   // Grab RAM CPU1TOCPU2 MSGRAM0_H
#define DCSM_Z2_GRABRAM2R_GRAB_RAM14_S  28U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM14_M  0x30000000U  // Grab RAM CPU2TOCPU1 MSGRAM0_L
#define DCSM_Z2_GRABRAM2R_GRAB_RAM15_S  30U
#define DCSM_Z2_GRABRAM2R_GRAB_RAM15_M  0xC0000000U  // Grab RAM CPU2TOCPU1 MSGRAM0_H

//*****************************************************************************
//
// The following are defines for the bit fields in the Z2_GRABRAM3R register
//
//*****************************************************************************
#define DCSM_Z2_GRABRAM3R_GRAB_RAM0_S  0U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM0_M  0x3U         // Grab RAM CPU2.LS0
#define DCSM_Z2_GRABRAM3R_GRAB_RAM1_S  2U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM1_M  0xCU         // Grab RAM CPU2.LS1
#define DCSM_Z2_GRABRAM3R_GRAB_RAM2_S  4U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM2_M  0x30U        // Grab RAM CPU2.LS2
#define DCSM_Z2_GRABRAM3R_GRAB_RAM3_S  6U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM3_M  0xC0U        // Grab RAM CPU2.LS3
#define DCSM_Z2_GRABRAM3R_GRAB_RAM4_S  8U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM4_M  0x300U       // Grab RAM CPU2.LS4
#define DCSM_Z2_GRABRAM3R_GRAB_RAM5_S  10U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM5_M  0xC00U       // Grab RAM CPU2.LS5
#define DCSM_Z2_GRABRAM3R_GRAB_RAM6_S  12U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM6_M  0x3000U      // Grab RAM CPU2.LS6
#define DCSM_Z2_GRABRAM3R_GRAB_RAM7_S  14U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM7_M  0xC000U      // Grab RAM CPU2.LS7
#define DCSM_Z2_GRABRAM3R_GRAB_RAM8_S  16U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM8_M  0x30000U     // Grab RAM CPU2.D0
#define DCSM_Z2_GRABRAM3R_GRAB_RAM9_S  18U
#define DCSM_Z2_GRABRAM3R_GRAB_RAM9_M  0xC0000U     // Grab RAM CPU2.D1

//*****************************************************************************
//
// The following are defines for the bit fields in the Z2_EXEONLYSECT1R register
//
//*****************************************************************************
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT0  0x1U         // Execute-Only Flash Sector 0
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT1  0x2U         // Execute-Only Flash Sector 1
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT2  0x4U         // Execute-Only Flash Sector 2
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT3  0x8U         // Execute-Only Flash Sector 3
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT4  0x10U        // Execute-Only Flash Sector 4
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT5  0x20U        // Execute-Only Flash Sector 5
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT6  0x40U        // Execute-Only Flash Sector 6
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT7  0x80U        // Execute-Only Flash Sector 7
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT8  0x100U       // Execute-Only Flash Sector 8
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT9  0x200U       // Execute-Only Flash Sector 9
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT10  0x400U       // Execute-Only Flash Sector 10
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT11  0x800U       // Execute-Only Flash Sector 11
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT12  0x1000U      // Execute-Only Flash Sector 12
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CPU1_SECT13  0x2000U      // Execute-Only Flash Sector 13
                                               // in flash CPU1 BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT0  0x10000U     // Execute-Only Flash Sector 0
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT1  0x20000U     // Execute-Only Flash Sector 1
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT2  0x40000U     // Execute-Only Flash Sector 2
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT3  0x80000U     // Execute-Only Flash Sector 3
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT4  0x100000U    // Execute-Only Flash Sector 4
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT5  0x200000U    // Execute-Only Flash Sector 5
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT6  0x400000U    // Execute-Only Flash Sector 6
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT7  0x800000U    // Execute-Only Flash Sector 7
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT8  0x1000000U   // Execute-Only Flash Sector 8
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT9  0x2000000U   // Execute-Only Flash Sector 9
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT10  0x4000000U   // Execute-Only Flash Sector 10
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT11  0x8000000U   // Execute-Only Flash Sector 11
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT12  0x10000000U  // Execute-Only Flash Sector 12
                                               // in flash CM BANK
#define DCSM_Z2_EXEONLYSECT1R_EXEONLY_CM_SECT13  0x20000000U  // Execute-Only Flash Sector 13
                                               // in flash CM BANK

//*****************************************************************************
//
// The following are defines for the bit fields in the Z2_EXEONLYSECT2R register
//
//*****************************************************************************
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT0  0x1U         // Execute-Only Flash Sector 0
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT1  0x2U         // Execute-Only Flash Sector 1
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT2  0x4U         // Execute-Only Flash Sector 2
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT3  0x8U         // Execute-Only Flash Sector 3
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT4  0x10U        // Execute-Only Flash Sector 4
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT5  0x20U        // Execute-Only Flash Sector 5
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT6  0x40U        // Execute-Only Flash Sector 6
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT7  0x80U        // Execute-Only Flash Sector 7
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT8  0x100U       // Execute-Only Flash Sector 8
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT9  0x200U       // Execute-Only Flash Sector 9
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT10  0x400U       // Execute-Only Flash Sector 10
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT11  0x800U       // Execute-Only Flash Sector 11
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT12  0x1000U      // Execute-Only Flash Sector 12
                                               // in flash CPU2 BANK
#define DCSM_Z2_EXEONLYSECT2R_EXEONLY_CPU2_SECT13  0x2000U      // Execute-Only Flash Sector 13
                                               // in flash CPU2 BANK

//*****************************************************************************
//
// The following are defines for the bit fields in the Z2_EXEONLYRAM1R register
//
//*****************************************************************************
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM0  0x1U         // Execute-Only RAM CPU1.LS0
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM1  0x2U         // Execute-Only RAM CPU1.LS1
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM2  0x4U         // Execute-Only RAM CPU1.LS2
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM3  0x8U         // Execute-Only RAM CPU1.LS3
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM4  0x10U        // Execute-Only RAM CPU1.LS4
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM5  0x20U        // Execute-Only RAM CPU1.LS5
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM6  0x40U        // Execute-Only RAM CPU1.LS6
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM7  0x80U        // Execute-Only RAM CPU1.LS7
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM8  0x100U       // Execute-Only RAM CPU1.D0
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM9  0x200U       // Execute-Only RAM CPU1.D1
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM16  0x10000U     // Execute-Only RAM on CM.C0
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM17  0x20000U     // Execute-Only RAM on CM.C1
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM22  0x400000U    // Execute-Only RAM CPU2.D1
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM23  0x800000U    // Execute-Only RAM CPU2.D0
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM24  0x1000000U   // Execute-Only RAM CPU2.LS7
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM25  0x2000000U   // Execute-Only RAM CPU2.LS6
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM26  0x4000000U   // Execute-Only RAM CPU2.LS5
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM27  0x8000000U   // Execute-Only RAM CPU2.LS4
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM28  0x10000000U  // Execute-Only RAM CPU2.LS3
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM29  0x20000000U  // Execute-Only RAM CPU2.LS2
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM30  0x40000000U  // Execute-Only RAM CPU2.LS1
#define DCSM_Z2_EXEONLYRAM1R_EXEONLY_RAM31  0x80000000U  // Execute-Only RAM CPU2.LS0

//*****************************************************************************
//
// The following are defines for the bit fields in the FLSEM register
//
//*****************************************************************************
#define DCSM_FLSEM_SEM_S          0U
#define DCSM_FLSEM_SEM_M          0x3U         // Flash Semaphore Bit
#define DCSM_FLSEM_KEY_S          8U
#define DCSM_FLSEM_KEY_M          0xFF00U      // Semaphore Key

//*****************************************************************************
//
// The following are defines for the bit fields in the SECTSTAT1 register
//
//*****************************************************************************
#define DCSM_SECTSTAT1_STATUS_SECT0_S  0U
#define DCSM_SECTSTAT1_STATUS_SECT0_M  0x3U         // Zone Status flash CPU1 BANK
                                               // Sector 0
#define DCSM_SECTSTAT1_STATUS_SECT1_S  2U
#define DCSM_SECTSTAT1_STATUS_SECT1_M  0xCU         // Zone Status flash CPU1 BANK
                                               // sector 1
#define DCSM_SECTSTAT1_STATUS_SECT2_S  4U
#define DCSM_SECTSTAT1_STATUS_SECT2_M  0x30U        // Zone Status flash CPU1 BANK
                                               // Sector 2
#define DCSM_SECTSTAT1_STATUS_SECT3_S  6U
#define DCSM_SECTSTAT1_STATUS_SECT3_M  0xC0U        // Zone Status flash CPU1 BANK
                                               // Sector 3
#define DCSM_SECTSTAT1_STATUS_SECT4_S  8U
#define DCSM_SECTSTAT1_STATUS_SECT4_M  0x300U       // Zone Status flash CPU1 BANK
                                               // Sector 4
#define DCSM_SECTSTAT1_STATUS_SECT5_S  10U
#define DCSM_SECTSTAT1_STATUS_SECT5_M  0xC00U       // Zone Status flash CPU1 BANK
                                               // Sector 5
#define DCSM_SECTSTAT1_STATUS_SECT6_S  12U
#define DCSM_SECTSTAT1_STATUS_SECT6_M  0x3000U      // Zone Status flash CPU1 BANK
                                               // Sector 6
#define DCSM_SECTSTAT1_STATUS_SECT7_S  14U
#define DCSM_SECTSTAT1_STATUS_SECT7_M  0xC000U      // Zone Status flash CPU1 BANK
                                               // Sector 7
#define DCSM_SECTSTAT1_STATUS_SECT8_S  16U
#define DCSM_SECTSTAT1_STATUS_SECT8_M  0x30000U     // Zone Status flash CPU1 BANK
                                               // sector 8
#define DCSM_SECTSTAT1_STATUS_SECT9_S  18U
#define DCSM_SECTSTAT1_STATUS_SECT9_M  0xC0000U     // Zone Status flash CPU1 BANK
                                               // Sector 9
#define DCSM_SECTSTAT1_STATUS_SECT10_S  20U
#define DCSM_SECTSTAT1_STATUS_SECT10_M  0x300000U    // Zone Status flash CPU1 BANK
                                               // Sector 10
#define DCSM_SECTSTAT1_STATUS_SECT11_S  22U
#define DCSM_SECTSTAT1_STATUS_SECT11_M  0xC00000U    // Zone Status flash CPU1 BANK
                                               // Sector 11
#define DCSM_SECTSTAT1_STATUS_SECT12_S  24U
#define DCSM_SECTSTAT1_STATUS_SECT12_M  0x3000000U   // Zone Status flash CPU1 BANK
                                               // Sector 12
#define DCSM_SECTSTAT1_STATUS_SECT13_S  26U
#define DCSM_SECTSTAT1_STATUS_SECT13_M  0xC000000U   // Zone Status flash CPU1 BANK
                                               // Sector 13

//*****************************************************************************
//
// The following are defines for the bit fields in the SECTSTAT2 register
//
//*****************************************************************************
#define DCSM_SECTSTAT2_STATUS_SECT0_S  0U
#define DCSM_SECTSTAT2_STATUS_SECT0_M  0x3U         // Zone Status flash CM BANK
                                               // Sector 0
#define DCSM_SECTSTAT2_STATUS_SECT1_S  2U
#define DCSM_SECTSTAT2_STATUS_SECT1_M  0xCU         // Zone Status flash CM BANK
                                               // sector 1
#define DCSM_SECTSTAT2_STATUS_SECT2_S  4U
#define DCSM_SECTSTAT2_STATUS_SECT2_M  0x30U        // Zone Status flash CM BANK
                                               // Sector 2
#define DCSM_SECTSTAT2_STATUS_SECT3_S  6U
#define DCSM_SECTSTAT2_STATUS_SECT3_M  0xC0U        // Zone Status flash CM BANK
                                               // Sector 3
#define DCSM_SECTSTAT2_STATUS_SECT4_S  8U
#define DCSM_SECTSTAT2_STATUS_SECT4_M  0x300U       // Zone Status flash CM BANK
                                               // Sector 4
#define DCSM_SECTSTAT2_STATUS_SECT5_S  10U
#define DCSM_SECTSTAT2_STATUS_SECT5_M  0xC00U       // Zone Status flash CM BANK
                                               // Sector 5
#define DCSM_SECTSTAT2_STATUS_SECT6_S  12U
#define DCSM_SECTSTAT2_STATUS_SECT6_M  0x3000U      // Zone Status flash CM BANK
                                               // Sector 6
#define DCSM_SECTSTAT2_STATUS_SECT7_S  14U
#define DCSM_SECTSTAT2_STATUS_SECT7_M  0xC000U      // Zone Status flash CM BANK
                                               // Sector 7
#define DCSM_SECTSTAT2_STATUS_SECT8_S  16U
#define DCSM_SECTSTAT2_STATUS_SECT8_M  0x30000U     // Zone Status flash CM BANK
                                               // sector 8
#define DCSM_SECTSTAT2_STATUS_SECT9_S  18U
#define DCSM_SECTSTAT2_STATUS_SECT9_M  0xC0000U     // Zone Status flash CM BANK
                                               // Sector 9
#define DCSM_SECTSTAT2_STATUS_SECT10_S  20U
#define DCSM_SECTSTAT2_STATUS_SECT10_M  0x300000U    // Zone Status flash CM BANK
                                               // Sector 10
#define DCSM_SECTSTAT2_STATUS_SECT11_S  22U
#define DCSM_SECTSTAT2_STATUS_SECT11_M  0xC00000U    // Zone Status flash CM BANK
                                               // Sector 11
#define DCSM_SECTSTAT2_STATUS_SECT12_S  24U
#define DCSM_SECTSTAT2_STATUS_SECT12_M  0x3000000U   // Zone Status flash CM BANK
                                               // Sector 12
#define DCSM_SECTSTAT2_STATUS_SECT13_S  26U
#define DCSM_SECTSTAT2_STATUS_SECT13_M  0xC000000U   // Zone Status flash CM BANK
                                               // Sector 13

//*****************************************************************************
//
// The following are defines for the bit fields in the SECTSTAT3 register
//
//*****************************************************************************
#define DCSM_SECTSTAT3_STATUS_SECT0_S  0U
#define DCSM_SECTSTAT3_STATUS_SECT0_M  0x3U         // Zone Status flash CPU2 BANK
                                               // Sector 0
#define DCSM_SECTSTAT3_STATUS_SECT1_S  2U
#define DCSM_SECTSTAT3_STATUS_SECT1_M  0xCU         // Zone Status flash CPU2 BANK
                                               // sector 1
#define DCSM_SECTSTAT3_STATUS_SECT2_S  4U
#define DCSM_SECTSTAT3_STATUS_SECT2_M  0x30U        // Zone Status flash CPU2 BANK
                                               // Sector 2
#define DCSM_SECTSTAT3_STATUS_SECT3_S  6U
#define DCSM_SECTSTAT3_STATUS_SECT3_M  0xC0U        // Zone Status flash CPU2 BANK
                                               // Sector 3
#define DCSM_SECTSTAT3_STATUS_SECT4_S  8U
#define DCSM_SECTSTAT3_STATUS_SECT4_M  0x300U       // Zone Status flash CPU2 BANK
                                               // Sector 4
#define DCSM_SECTSTAT3_STATUS_SECT5_S  10U
#define DCSM_SECTSTAT3_STATUS_SECT5_M  0xC00U       // Zone Status flash CPU2 BANK
                                               // Sector 5
#define DCSM_SECTSTAT3_STATUS_SECT6_S  12U
#define DCSM_SECTSTAT3_STATUS_SECT6_M  0x3000U      // Zone Status flash CPU2 BANK
                                               // Sector 6
#define DCSM_SECTSTAT3_STATUS_SECT7_S  14U
#define DCSM_SECTSTAT3_STATUS_SECT7_M  0xC000U      // Zone Status flash CPU2 BANK
                                               // Sector 7
#define DCSM_SECTSTAT3_STATUS_SECT8_S  16U
#define DCSM_SECTSTAT3_STATUS_SECT8_M  0x30000U     // Zone Status flash CPU2 BANK
                                               // sector 8
#define DCSM_SECTSTAT3_STATUS_SECT9_S  18U
#define DCSM_SECTSTAT3_STATUS_SECT9_M  0xC0000U     // Zone Status flash CPU2 BANK
                                               // Sector 9
#define DCSM_SECTSTAT3_STATUS_SECT10_S  20U
#define DCSM_SECTSTAT3_STATUS_SECT10_M  0x300000U    // Zone Status flash CPU2 BANK
                                               // Sector 10
#define DCSM_SECTSTAT3_STATUS_SECT11_S  22U
#define DCSM_SECTSTAT3_STATUS_SECT11_M  0xC00000U    // Zone Status flash CPU2 BANK
                                               // Sector 11
#define DCSM_SECTSTAT3_STATUS_SECT12_S  24U
#define DCSM_SECTSTAT3_STATUS_SECT12_M  0x3000000U   // Zone Status flash CPU2 BANK
                                               // Sector 12
#define DCSM_SECTSTAT3_STATUS_SECT13_S  26U
#define DCSM_SECTSTAT3_STATUS_SECT13_M  0xC000000U   // Zone Status flash CPU2 BANK
                                               // Sector 13

