maxboss10086/max_dsp/max/F28388D/clb_pwm/device/driverlib/inc/hw_dcsm.h
//*****************************************************************************
//
// The following are defines for the bit fields in the RAMSTAT1 register
//
//*****************************************************************************
#define DCSM_RAMSTAT1_STATUS_RAM0_S  0U
#define DCSM_RAMSTAT1_STATUS_RAM0_M  0x3U         // Zone Status RAM CPU1.LS0
#define DCSM_RAMSTAT1_STATUS_RAM1_S  2U
#define DCSM_RAMSTAT1_STATUS_RAM1_M  0xCU         // Zone Status RAM CPU1.LS1
#define DCSM_RAMSTAT1_STATUS_RAM2_S  4U
#define DCSM_RAMSTAT1_STATUS_RAM2_M  0x30U        // Zone Status RAM CPU1.LS2
#define DCSM_RAMSTAT1_STATUS_RAM3_S  6U
#define DCSM_RAMSTAT1_STATUS_RAM3_M  0xC0U        // Zone Status RAM CPU1.LS3
#define DCSM_RAMSTAT1_STATUS_RAM4_S  8U
#define DCSM_RAMSTAT1_STATUS_RAM4_M  0x300U       // Zone Status RAM CPU1.LS4
#define DCSM_RAMSTAT1_STATUS_RAM5_S  10U
#define DCSM_RAMSTAT1_STATUS_RAM5_M  0xC00U       // Zone Status RAM CPU1.LS5
#define DCSM_RAMSTAT1_STATUS_RAM6_S  12U
#define DCSM_RAMSTAT1_STATUS_RAM6_M  0x3000U      // Zone Status RAM CPU1.LS6
#define DCSM_RAMSTAT1_STATUS_RAM7_S  14U
#define DCSM_RAMSTAT1_STATUS_RAM7_M  0xC000U      // Zone Status RAM CPU1.LS7
#define DCSM_RAMSTAT1_STATUS_RAM8_S  16U
#define DCSM_RAMSTAT1_STATUS_RAM8_M  0x30000U     // Zone Status RAM CPU1.D0
#define DCSM_RAMSTAT1_STATUS_RAM9_S  18U
#define DCSM_RAMSTAT1_STATUS_RAM9_M  0xC0000U     // Zone Status RAM CPU1.D1

//*****************************************************************************
//
// The following are defines for the bit fields in the RAMSTAT2 register
//
//*****************************************************************************
#define DCSM_RAMSTAT2_STATUS_RAM0_S  0U
#define DCSM_RAMSTAT2_STATUS_RAM0_M  0x3U         // Zone Status RAM CM.C0
#define DCSM_RAMSTAT2_STATUS_RAM1_S  2U
#define DCSM_RAMSTAT2_STATUS_RAM1_M  0xCU         // Zone Status RAM CM.C1
#define DCSM_RAMSTAT2_STATUS_RAM4_S  8U
#define DCSM_RAMSTAT2_STATUS_RAM4_M  0x300U       // Zone Status RAM CPU1 to CM
                                               // MSG RAM 1
#define DCSM_RAMSTAT2_STATUS_RAM5_S  10U
#define DCSM_RAMSTAT2_STATUS_RAM5_M  0xC00U       // Zone Status RAM CPU1 to CM
                                               // MSG RAM 2
#define DCSM_RAMSTAT2_STATUS_RAM6_S  12U
#define DCSM_RAMSTAT2_STATUS_RAM6_M  0x3000U      // Zone Status RAM CM to CPU1
                                               // MSG RAM 1
#define DCSM_RAMSTAT2_STATUS_RAM7_S  14U
#define DCSM_RAMSTAT2_STATUS_RAM7_M  0xC000U      // Zone Status RAM CM to CPU1
                                               // MSG RAM 2
#define DCSM_RAMSTAT2_STATUS_RAM8_S  16U
#define DCSM_RAMSTAT2_STATUS_RAM8_M  0x30000U     // Zone Status RAM CPU2 to CM
                                               // MSG RAM 1
#define DCSM_RAMSTAT2_STATUS_RAM9_S  18U
#define DCSM_RAMSTAT2_STATUS_RAM9_M  0xC0000U     // Zone Status RAM CPU2 to CM
                                               // MSG RAM 2
#define DCSM_RAMSTAT2_STATUS_RAM10_S  20U
#define DCSM_RAMSTAT2_STATUS_RAM10_M  0x300000U    // Zone Status RAM CM to CPU2
                                               // MSG RAM 1
#define DCSM_RAMSTAT2_STATUS_RAM11_S  22U
#define DCSM_RAMSTAT2_STATUS_RAM11_M  0xC00000U    // Zone Status RAM CM to CPU2
                                               // MSG RAM 2
#define DCSM_RAMSTAT2_STATUS_RAM12_S  24U
#define DCSM_RAMSTAT2_STATUS_RAM12_M  0x3000000U   // Zone Status RAM CPU1 to CPU2
                                               // MSG RAM 1
#define DCSM_RAMSTAT2_STATUS_RAM13_S  26U
#define DCSM_RAMSTAT2_STATUS_RAM13_M  0xC000000U   // Zone Status RAM CPU1 to CPU2
                                               // MSG RAM 2
#define DCSM_RAMSTAT2_STATUS_RAM14_S  28U
#define DCSM_RAMSTAT2_STATUS_RAM14_M  0x30000000U  // Zone Status RAM CPU2 to CPU1
                                               // MSG RAM 1
#define DCSM_RAMSTAT2_STATUS_RAM15_S  30U
#define DCSM_RAMSTAT2_STATUS_RAM15_M  0xC0000000U  // Zone Status RAM CPU2 to CPU1
                                               // MSG RAM 2

//*****************************************************************************
//
// The following are defines for the bit fields in the RAMSTAT3 register
//
//*****************************************************************************
#define DCSM_RAMSTAT3_STATUS_RAM0_S  0U
#define DCSM_RAMSTAT3_STATUS_RAM0_M  0x3U         // Zone Status RAM CPU2.LS0
#define DCSM_RAMSTAT3_STATUS_RAM1_S  2U
#define DCSM_RAMSTAT3_STATUS_RAM1_M  0xCU         // Zone Status RAM CPU2.LS1
#define DCSM_RAMSTAT3_STATUS_RAM2_S  4U
#define DCSM_RAMSTAT3_STATUS_RAM2_M  0x30U        // Zone Status RAM CPU2.LS2
#define DCSM_RAMSTAT3_STATUS_RAM3_S  6U
#define DCSM_RAMSTAT3_STATUS_RAM3_M  0xC0U        // Zone Status RAM CPU2.LS3
#define DCSM_RAMSTAT3_STATUS_RAM4_S  8U
#define DCSM_RAMSTAT3_STATUS_RAM4_M  0x300U       // Zone Status RAM CPU2.LS4
#define DCSM_RAMSTAT3_STATUS_RAM5_S  10U
#define DCSM_RAMSTAT3_STATUS_RAM5_M  0xC00U       // Zone Status RAM CPU2.LS5
#define DCSM_RAMSTAT3_STATUS_RAM6_S  12U
#define DCSM_RAMSTAT3_STATUS_RAM6_M  0x3000U      // Zone Status RAM CPU2.LS6
#define DCSM_RAMSTAT3_STATUS_RAM7_S  14U
#define DCSM_RAMSTAT3_STATUS_RAM7_M  0xC000U      // Zone Status RAM CPU2.LS7
#define DCSM_RAMSTAT3_STATUS_RAM8_S  16U
#define DCSM_RAMSTAT3_STATUS_RAM8_M  0x30000U     // Zone Status RAM CPU2.D0
#define DCSM_RAMSTAT3_STATUS_RAM9_S  18U
#define DCSM_RAMSTAT3_STATUS_RAM9_M  0xC0000U     // Zone Status RAM CPU2.D1

//*****************************************************************************
//
// The following are defines for the bit fields in the SECERRSTAT register
//
//*****************************************************************************
#define DCSM_SECERRSTAT_ERR       0x1U         // Security Configuration load
                                               // Error Status

//*****************************************************************************
//
// The following are defines for the bit fields in the SECERRCLR register
//
//*****************************************************************************
#define DCSM_SECERRCLR_ERR        0x1U         // Clear Security Configuration
                                               // Load Error Status Bit

//*****************************************************************************
//
// The following are defines for the bit fields in the SECERRFRC register
//
//*****************************************************************************
#define DCSM_SECERRFRC_ERR        0x1U         // Set Security Configuration
                                               // Load Error Status Bit
#define DCSM_SECERRFRC_KEY_S      16U
#define DCSM_SECERRFRC_KEY_M      0xFFFF0000U  // Valid Register Write Key
#endif
